app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test name"], ["email", "test email"], ["created_at", 2017-06-12 07:29:09 UTC], ["updated_at", 2017-06-12 07:29:09 UTC]]
---
	def create
		@author = Author.new(author_params)

		if @author.save

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "authors" SET "email" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["email", "test@email1.com"], ["updated_at", 2017-06-12 08:51:08 UTC], ["id", 3]]
---
	def update
		@author = Author.find(params[:id])
		if @author.update(author_params)

DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 5]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def destroy
		Author.find(params[:id]).destroy