app/controllers/books_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "books" ("name", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)
---
	def create
		@book = Book.new(book_params)
		@book.author = Author.find(@book.author_id)

		if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "edit name test"], ["updated_at", 2017-05-27 05:25:42 UTC], ["id", 3]]
---
	def update
		@book = Book.find(params[:id])
		if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 3]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def destroy
		Book.find(params[:id]).destroy